import Suggestion from "./Suggestion";
import Title from "../../../Title";
import meter from "../../../../assets/images/profile/meter.png";
import styled from "styled-components";
import { useState } from "react";

const Container = styled.div`
  margin: 20px 0;
  height: 225px;
  overflow-y: auto;
  direction: ltr;
  padding-right: 15px;
  @media (min-width: 844px) {
    height: 255px;
  }
  @media (min-width: 880px) {
    height: 210px !important;
  }
  @media (min-width: 890px) {
    height: 275px !important;
  }
  @media (min-width: 900px) {
    height: 270px !important;
  }
  @media (min-width: 930px) {
    height: 290px !important;
  }
  @media (min-width: 1024px) {
    height: 400px !important;
  }
  @media (min-width: 1180px) {
    height: 595px !important;
  }
  @media (min-width: 1280px) {
    height: 630px !important;
  }
  @media (min-width: 1366px) {
    height: 640px !important;
  }
`;

const Wrapper = styled.div`
  display: grid;
  align-items: start;
  gap: 20px;
  margin-top: 20px;
`;

const suggestions_items = [
  {
    id: 1,
    property: {
      image: meter,
      location: "قزوین، خیابان جانبازان نور",
      code: "AR-1011",
      owner: "HM-200020",
      date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
      value: "۱۱۰",
      rial: "۳M",
      psc: "۳K",
      coordinates: [
        { x: 54.215679675989, y: 25.219179094737 },
        { x: 54.215765544775, y: 25.219171453424 },
        { x: 54.215595863959, y: 25.217803151101 },
        { x: 54.215471485397, y: 25.217817780768 },
        { x: 54.21565679103, y: 25.219181886007 },
        { x: 54.215679675989, y: 25.219179094737 },
      ],
    },
    suggestions_list: [
      {
        id: 1,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 20,
        initialMinutes: 43,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
      {
        id: 2,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 20,
        initialMinutes: 43,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
      {
        id: 3,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 20,
        initialMinutes: 43,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
    ],
  },
  {
    id: 2,
    property: {
      image: meter,
      location: "قزوین، خیابان جانبازان نور",
      code: "TO11-1814",
      owner: "HM-2000003",
      date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
      value: "1937",
      rial: "۳M",
      psc: "۳K",
      coordinates: [
        { x: 26.26465337224, y: 55.303757686536 },
        { x: 26.264646038876, y: 55.303137138309 },
        { x: 26.265089568044, y: 55.303130689382 },
        { x: 26.2647916991, y: 55.303720633629 },
        { x: 26.264773875135, y: 55.303755935076 },
        { x: 26.26465337224, y: 55.303757686536 },
      ],
    },
    suggestions_list: [
      {
        id: 1,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 60,
        initialMinutes: 43,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
      {
        id: 2,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 60,
        initialMinutes: 43,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
      {
        id: 3,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 60,
        initialMinutes: 43,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
    ],
  },
  {
    id: 3,
    property: {
      image: meter,
      location: "قزوین، خیابان جانبازان نور",
      code: "QA31-11484",
      owner: "HM-200020",
      date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
      value: "251",
      rial: "۳M",
      psc: "۳K",
      coordinates: [
        { x: 36.315011922382, y: 50.035695328768 },
        { x: 36.314879168504, y: 50.035573014622 },
        { x: 36.314979982045, y: 50.035431101895 },
        { x: 36.315003498523, y: 50.035444810684 },
        { x: 36.315016539635, y: 50.035457291306 },
        { x: 36.315027840571, y: 50.035472138542 },
        { x: 36.315037123198, y: 50.035488986979 },
        { x: 36.315044159057, y: 50.035507421954 },
        { x: 36.315048774985, y: 50.035526989754 },
        { x: 36.315050857377, y: 50.035547208787 },
        { x: 36.315050354983, y: 50.035567581434 },
        { x: 36.315011922382, y: 50.035695328768 },
      ],
    },
    suggestions_list: [
      {
        id: 1,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 80,
        initialMinutes: 23,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
      {
        id: 2,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 80,
        initialMinutes: 23,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
      {
        id: 3,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 80,
        initialMinutes: 23,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
    ],
  },
  {
    id: 4,
    property: {
      image: meter,
      location: "قزوین، خیابان جانبازان نور",
      code: "QA31-11502",
      owner: "HM-200020",
      date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
      value: "5943",
      rial: "۳M",
      psc: "۳K",
      coordinates: [
        { x: 36.316952221202, y: 50.032521396 },
        { x: 36.316271978156, y: 50.03220909617 },
        { x: 36.316503776089, y: 50.031438174234 },
        { x: 36.316757283722, y: 50.031554556953 },
        { x: 36.317184021938, y: 50.031750468185 },
        { x: 36.316952221202, y: 50.032521396 },
      ],
    },
    suggestions_list: [
      {
        id: 1,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 100,
        initialMinutes: 13,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
      {
        id: 2,
        code: "HM-200020",
        date: "۲۰ اردیبهشت ۱۴۰۰۲ | ۱۲:۳۰",
        rial: "۳M",
        psc: "۳K",
        percent: "۲۱۰",
        initialHours: 100,
        initialMinutes: 13,
        initialSeconds: 9,
        information:
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف  آینده شناخت فراوان جامعه و متخصصان را می طلبد لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف آینده شناخت فراوان جامعه و متخصصان را می طلبد",
      },
    ],
  },
];

const SentSuggestion = () => {
  const [suggestions, setSuggestions] = useState(suggestions_items);
  const handleRejectProposal = (suggestionId, proposerId) => {
    setSuggestions((prevSuggestions) =>
      prevSuggestions.map((suggestion) =>
        suggestion.id === suggestionId
          ? {
              ...suggestion,
              suggestions_list: suggestion.suggestions_list.filter(
                (proposer) => proposer.id !== proposerId
              ),
            }
          : suggestion
      )
    );
  };
  return (
    <Container>
      <Title right title="پیشنهادات ارسالی" />
      <Wrapper>
        {suggestions.map(
          (suggestion) =>
            suggestion.suggestions_list.length > 0 && (
              <Suggestion
                key={suggestion.id}
                {...suggestion}
                onRejectProposal={handleRejectProposal}
              />
            )
        )}
      </Wrapper>
    </Container>
  );
};

export default SentSuggestion;
