import { createContext, useContext, useReducer } from "react";

const initialState = {
  notes: [
    {
      id: 1,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 1, file: "file1.txt" }],
      code: 12345,
      publish_date: "۲۱ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 2,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 2, file: "file2.txt" }],
      code: 12346,
      publish_date: "۲۲ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 3,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 3, file: "file3.txt" }],
      code: 12347,
      publish_date: "۲۳ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 4,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 4, file: "file4.txt" }],
      code: 12348,
      publish_date: "۲۴ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 5,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 5, file: "file5.txt" }],
      code: 12349,
      publish_date: "۲۵ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 6,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 6, file: "file6.txt" }],
      code: 12350,
      publish_date: "۲۶ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 7,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 7, file: "file7.txt" }],
      code: 12351,
      publish_date: "۲۷ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 8,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 8, file: "file8.txt" }],
      code: 12352,
      publish_date: "۲۸ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 9,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 9, file: "file9.txt" }],
      code: 12353,
      publish_date: "۲۹ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
    {
      id: 10,
      name: "یوسف خدری",
      title: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله درستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز وکاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
      files: [{ id: 10, file: "file10.txt" }],
      code: 12354,
      publish_date: "۳۰ اردیبهشت ۱۴۰۳ | ۱۶:۲۱:۰۸",
    },
  ],
};

const reducer = (state, action) => {
  switch (action.type) {
    case "SET_NOTES":
      return { ...state, title: action.payload };
    default:
      return state;
  }
};

const GlobalNoteStateContext = createContext();

export const GlobalNoteStateProvider = ({ children }) => {
  const [state, dispatch] = useReducer(reducer, initialState);

  return (
    <GlobalNoteStateContext.Provider value={{ state, dispatch }}>
      {children}
    </GlobalNoteStateContext.Provider>
  );
};

export const useGlobalNotesState = () => {
  return useContext(GlobalNoteStateContext);
};
